<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"ba0850cda70fba0e8cda5070893ae91951508c36c973f6c502de8749a0afbbee","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1669 at https://github.com/cal-itp/data-infra/actions/runs/23323564200","plan_out_hash":"e2de7527ba5cfa0e6cf1ab5b0886c7a84aa4629cab7d20283abe0bb400891f8f","plan_hash":"60a93e1ad1e45caf5c142dc7ccd788f510c248ba6343b8a968a7dac51b9a815d","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/publish_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "PA4VUQ==" -> (known after apply)
!~      detect_md5hash      = "SwNvAaB96NWuDxpNvDymjQ==" -> "different hash"
!~      generation          = 1772670944590864 -> (known after apply)
        id                  = "calitp-staging-composer-dags/publish_gtfs.py"
!~      md5hash             = "SwNvAaB96NWuDxpNvDymjQ==" -> (known after apply)
        name                = "dags/publish_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "5jA0Gw==" -> (known after apply)
!~      detect_md5hash      = "aUlytU5MfX30rwejjy4g0A==" -> "different hash"
!~      generation          = 1773965187462412 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "aUlytU5MfX30rwejjy4g0A==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "uoyUtQ==" -> (known after apply)
!~      detect_md5hash      = "2965QdQUq/KpQMiqVBYKuA==" -> "different hash"
!~      generation          = 1773965189073553 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "2965QdQUq/KpQMiqVBYKuA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1669](https://github.com/cal-itp/data-infra/actions/runs/23323564200)